controllers/SiteController.php

SELECT COUNT(*) FROM `article`
SELECT * FROM `article` LIMIT 10
---
    public function actionIndex()
    {
        $query = Article::find();

       $pagination = new Pagination([
           'defaultPageSize' => 10,
           'totalCount' => $query->count(),
       ]);

       $article = $query->offset($pagination->offset) //add order by date after tests
           ->limit($pagination->limit)
           ->all();

SELECT * FROM `article` WHERE `article_id`='2'
---
    public function actionPost($id)
    {
         $request = Yii::$app->request;
         $query = Article::find()->where(['article_id' => $id])->one();

SELECT * FROM `portfolio`
---
    public function actionPortfolio(){
        $query = Portfolio::find()->all();